app/controllers/contents_controller.rb

SELECT "contents".* FROM "contents"
---
  def index
    contents = Content.all

INSERT INTO "contents" ("page_link", "created_at", "updated_at") VALUES (?, ?, ?)  [["page_link", "http://www.cerebris.com/blog/2014/08/22/introducing-jsonapi-resources/"], ["created_at", "2018-04-01 05:01:12.037804"], ["updated_at", "2018-04-01 05:01:12.037804"]]
---
  def create

    begin

      if params[:page_link] =~ URI::regexp

        page = Nokogiri::HTML(open(params[:page_link]))
        h1 = page.css('h1').map(&:text).join(";")
        h2 = page.css('h2').map(&:text).join(";")
        h3 = page.css('h3').map(&:text).join(";")

        content = Content.create!(:page_link => params[:page_link], :h1_tag => h1, :h2_tag => h2, :h3_tag => h3)